[
  {
    "id": 1,
    "title": "Word Explorers (English-based Session)",
    "description": "<p align=\"left\"><strong>Objective:<br /></strong> To enhance children’s confidence in communication, language use, and creative expression by blending elements of storytelling, writing, debating, and vocabulary games.</p><p align=\"left\"><strong>Why We’re Doing It:<br /></strong> Language is foundational for self-expression and social engagement. This activity helps children express ideas confidently, develop a love for language, and build foundational skills aligned with the Cambridge Young Learners framework.</p><p align=\"left\"><strong>How It Will Be Done:</strong></p><ul><li><p align=\"left\">Children participate in storytelling games, short creative writing exercises, team-based vocabulary races, and debate-style games.<br /><br /></p></li><li><p align=\"left\">Sessions will be interactive and paced for engagement across age levels.<br /><br /></p></li><li><p align=\"left\">Team-based tasks contribute to the group’s overall score, encouraging collaboration as well as individual voice.</p></li></ul>"
  },
  {
    "id": 2,
    "title": "Logic Quest (Math Scavenger Hunt)",
    "description": "<p align=\"left\"><strong>Objective:<br /></strong> To develop logical reasoning, problem-solving, and applied math skills through a team-based scavenger hunt format.</p><p align=\"left\"><strong>Why We’re Doing It:<br /></strong> Math becomes meaningful when it’s linked to real-world situations. This activity helps children see math not as a subject to memorize, but a tool to navigate challenges, patterns, and tasks.</p><p align=\"left\"><strong>How It Will Be Done:</strong></p><ul><li><p align=\"left\">Children move through different clue stations that require solving puzzles, decoding patterns, performing quick mental math, or managing simple budgets.<br /><br /></p></li><li><p align=\"left\">Teams will follow a trail map that unlocks challenges with every correct answer.<br /><br /></p></li><li><p align=\"left\">Designed to ensure engagement through movement, collaboration, and competition.</p></li></ul>"
  },
  {
    "id": 3,
    "title": "Tech Challenge (Robotics)",
    "description": "<p align=\"left\"><strong>Objective:<br /></strong> To introduce foundational engineering and logic concepts through physical, hands-on robotics challenges.</p><p align=\"left\"><strong>Why We’re Doing It:<br /></strong> Robotics is a powerful way to introduce structured thinking and tangible problem-solving. It builds curiosity around technology while developing perseverance and collaboration.</p><p align=\"left\"><strong>How It Will Be Done:</strong></p><ul><li><p align=\"left\">Children work in teams using pre-designed robotics kits to assemble and test mechanical solutions.<br /><br /></p></li><li><p align=\"left\">Challenges include object-pushing, directional control, and basic motion logic.<br /><br /></p></li><li><p align=\"left\">Facilitators will guide groups through structured but flexible tasks, allowing space for both learning and creativity.</p></li></ul>"
  },
  {
    "id": 4,
    "title": "SEL Energizer (Social-Emotional Learning)",
    "description": "<p align=\"left\"><strong>Objective:<br /></strong> To help children reflect, recharge, and build emotional awareness through intentional group-based activities.</p><p align=\"left\"><strong>Why We’re Doing It:<br /></strong> In a high-energy day of learning, it is essential to pause, reflect, and center attention. SEL helps children process their experiences, recognize their own growth, and strengthen empathy and emotional literacy.</p><p align=\"left\"><strong>How It Will Be Done:</strong></p><ul><li><p align=\"left\">Children participate in guided reflection circles, team appreciation activities, and emotional expression games.<br /><br /></p></li><li><p align=\"left\">Light breathing and mindful movement will be introduced to restore focus before the final creative session.<br /><br /></p></li><li><p align=\"left\">Encourages bonding and group cohesion in a calm, grounded environment.</p></li></ul>"
  },
  {
    "id": 5,
    "title": "Frame by Frame (Animation and Story Art)",
    "description": "<p align=\"left\"><strong>Objective:<br /></strong> To enable children to translate stories into visual sequences, introducing the basics of animation through drawing, sequencing, and character design.</p><p align=\"left\"><strong>Why We’re Doing It:<br /></strong> Animation offers a fun, hands-on way to develop creative thinking, narrative understanding, and attention to detail. It also bridges storytelling with visual literacy, which is essential for digital-age learners.</p><p align=\"left\"><strong>How It Will Be Done:</strong></p><ul><li><p align=\"left\">Children will engage in basic storyboarding, draw short flipbook sequences, and explore stop-motion using crafted materials.<br /><br /></p></li><li><p align=\"left\">Older children will be introduced to the concept of 3D animation logic using a Blender-inspired paper method.<br /><br /></p></li><li><p align=\"left\">This activity encourages planning, storytelling, and fine motor coordination in a relaxed creative format.</p></li></ul>"
  },
  {
    "id": 6,
    "title": "Team Relay Challenge and Final Task",
    "description": "<p align=\"left\"><strong>Objective:<br /></strong> To integrate elements from all four stations into a dynamic, fun competition that reinforces learning through action.</p><p align=\"left\"><strong>Why We’re Doing It:<br /></strong> This capstone task helps children recall, connect, and apply what they’ve learned while reinforcing team collaboration and peer support. It also helps in evaluating soft skills like leadership, creativity, and adaptability.</p><p align=\"left\"><strong>How It Will Be Done:</strong></p><ul><li><p align=\"left\">Teams will rotate through quick, high-energy mini-tasks drawn from the day's four core themes (math puzzle, word challenge, movement-based task, creative sketch).<br /><br /></p></li><li><p align=\"left\">The final score will determine winning teams, with recognition for individual contributions in areas like creativity, collaboration, and effort.<br /><br /><br /></p></li></ul><p align=\"left\">&nbsp;</p><h3 class=\"western\"><a name=\"_ndoe0h8ldps9\"></a> <span style=\"color: #000000;\"><span style=\"font-size: medium;\"><strong>Closing Ceremony</strong></span></span></h3><ul><li><p align=\"left\">Each child receives a participation certificate and feedback on their performance.<br /><br /></p></li><li><p align=\"left\">Awards are given for creativity, effort, communication, and team spirit.<br /><br /></p></li><li><p align=\"left\">A brief stakeholder reflection and team photo wrap up the event.</p></li></ul>"
  }
]
